InformationRegisters/__СостояниеЗаданийСервераПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостояниеЗаданийСервераПечати</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.__ВидыЗаданийСервераПечати</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабличныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяПринтера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СостояниеСервераПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостояниеСервераПечати</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвтоматическийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоВыполненныхЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СостояниеЗаданийСервераПечати/Ext/ManagerModule.bsl
Процедура Напечатать(ТабличныйДокумент, Вид = Неопределено) Экспорт 
	
	// Проверка.
	Если (Не ТабличныйДокумент = Неопределено) И (Не Булево(ТабличныйДокумент.ВысотаТаблицы + ТабличныйДокумент.ШиринаТаблицы)) Тогда 
		Возврат; 
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Запись задания.
	Запись = РегистрыСведений.__СостояниеЗаданийСервераПечати.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Новый УникальныйИдентификатор;
	Запись.ТабличныйДокумент = Новый ХранилищеЗначения(ТабличныйДокумент);
	Запись.ИмяПринтера = ТабличныйДокумент.ИмяПринтера;
	Запись.Вид = Вид;
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // Напечатать()


Функция ПолучитьЗадания() Экспорт 
	
	Результат = Новый Массив; МустойМассив = Новый Массив;

	НачатьТранзакцию();
	
	// Выборка данных.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	__СостояниеЗаданийСервераПечати.Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.__СостояниеЗаданийСервераПечати КАК __СостояниеЗаданийСервераПечати
	                      |ГДЕ
	                      |	(НЕ __СостояниеЗаданийСервераПечати.Распечатан)
	                      |
	                      |ДЛЯ ИЗМЕНЕНИЯ
	                      |	РегистрСведений.__СостояниеЗаданийСервераПечати");
	РузультатЗапроса = Запрос.Выполнить();
	
	Если РузультатЗапроса.Пустой() Тогда
		ОтменитьТранзакцию();
	Иначе
	
		УстановитьПривилегированныйРежим(Истина);
		
		// Запись данных.
		Выборка = РузультатЗапроса.Выбрать(); Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.__СостояниеЗаданийСервераПечати.СоздатьМенеджерЗаписи();
			Запись.Идентификатор = Выборка.Идентификатор;
			Попытка
				Запись.Прочитать();
				Запись.Распечатан = Истина;
				Запись.Записать();
			Исключение
				// TODO
				ОтменитьТранзакцию(); Возврат МустойМассив;
			КонецПопытки;
			
			// Выборка данных.
			ТабличныйДокумент = Запись.ТабличныйДокумент.Получить();
			Если (Не ТабличныйДокумент = Неопределено) И (ТабличныйДокумент.ВысотаТаблицы + ТабличныйДокумент.ШиринаТаблицы) Тогда 
				Результат.Добавить(ТабличныйДокумент);
			КонецЕсли;
		КонецЦикла;
		Попытка
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию(); Возврат МустойМассив;
		КонецПопытки;
		
		// Статистика.
		Запись = РегистрыСведений.__СостояниеСервераПечати.СоздатьМенеджерЗаписи();
		Запись.КоличествоВыполненныхЗаданий = Запись.КоличествоВыполненныхЗаданий + Результат.Количество(); 
		Попытка
			Запись.Записать();
		Исключение КонецПопытки; // Потеряли статистику, но не критично.
	
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	// Результат.
	Возврат Результат;
	
КонецФункции // ПолучитьЗадания()

Процедура ОчиститьЗадания() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);

	// Выборка данных.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	__СостояниеЗаданийСервераПечати.Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.__СостояниеЗаданийСервераПечати КАК __СостояниеЗаданийСервераПечати
	                      |ГДЕ
	                      |	__СостояниеЗаданийСервераПечати.ДатаНачалаПериода < &ДатаНачалаПериода
	                      |
	                      |ДЛЯ ИЗМЕНЕНИЯ
	                      |	РегистрСведений.__СостояниеЗаданийСервераПечати");
	Запрос.УстановитьПараметр("ДатаНачалаПериода", РегистрыСведений.__НастройкиВебСервиса.ПолучитьГраницуХраненияЗаданий());
	РузультатЗапроса = Запрос.Выполнить();
	
	Если Не РузультатЗапроса.Пустой() Тогда
		
		// Удаление данных.
		Запись = РегистрыСведений.__СостояниеЗаданийСервераПечати.СоздатьМенеджерЗаписи();
		
		Выборка = РузультатЗапроса.Выбрать(); Пока Выборка.Следующий() Цикл
			Запись.Идентификатор = Выборка.Идентификатор;
			Попытка
				Запись.Удалить();
			Исключение
				// TODO
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОчиститьЗадания()
